[
  {
    "id": "1",
    "image": "images/airpods.jpg",
    "name": "Apple AirPods",
    "description": "Enjoy crystal-clear sound and seamless connectivity with Apple's AirPods. Featuring voice-activated Siri access and a wireless charging case, these earbuds offer a high-quality listening experience and extended battery life for all-day use.",
    "price": 1090,
    "features": "The Apple AirPods combine innovation and convenience in one compact design. Powered by the H1 chip, they deliver faster wireless connectivity, improved sound quality, and low-latency audio for immersive entertainment. Adaptive EQ automatically tunes the music to your ear shape, while dual beamforming microphones ensure crystal-clear calls in any environment. The wireless charging case offers up to 24 hours of battery life, and the earbuds themselves instantly pair with all your Apple devices, seamlessly switching between iPhone, iPad, and Mac. Designed for comfort and functionality, AirPods redefine how you experience sound.",
    "inTheBox": [
      "AirPods",
      "Wireless Charging Case",
      "Lightning to USB-C Cable"
    ],
    "extraImages": [
      "images/airpods-1.jpg",
      "images/airpods-2.jpg",
      "images/airpods-3.jpg"
    ],
    "category": "earphone",
    "isNew": false
  },
  {
    "id": "2",
    "image": "images/sony-wh1000xm5.jpg",
    "name": "Sony WH-1000XM5",
    "description": "Industry-leading noise cancellation meets exceptional comfort. Enjoy immersive sound, hands-free calling, and up to 30 hours of battery life.",
    "price": 1590,
    "features": "Sony's WH-1000XM5 headphones elevate audio performance to a professional level with cutting-edge noise cancellation powered by dual processors and eight microphones. The integrated V1 processor ensures high-resolution audio that remains pure and distortion-free even in wireless mode. Their lightweight, soft-fit leather design provides all-day comfort, while adaptive sound control automatically adjusts to your environment. With support for voice assistants, multi-device pairing, and 30-hour battery life, the WH-1000XM5 is a true blend of power, comfort, and intelligence designed for serious listeners.",
    "inTheBox": ["Headphones", "Carrying Case", "USB-C Cable", "Audio Cable"],
    "extraImages": [
      "images/sony-1.jpg",
      "images/sony-2.jpg",
      "images/sony-3.jpg"
    ],
    "category": "headphone",
    "isNew": true
  },
  {
    "id": "3",
    "image": "images/jbl-flip6.jpg",
    "name": "JBL Flip 6",
    "description": "Powerful portable Bluetooth speaker with deep bass and 12 hours of playtime. IP67 waterproof and dustproof for any adventure.",
    "price": 650,
    "features": "The JBL Flip 6 redefines portability with a rugged design that delivers superior sound anywhere you go. Featuring a two-way speaker system with optimized racetrack-shaped drivers, the Flip 6 produces powerful bass and detailed treble for balanced performance. Its IP67 waterproof and dustproof rating means it can handle poolside splashes or dusty trails with ease. Connect multiple JBL speakers with PartyBoost for an even louder experience. The 12-hour battery keeps the music playing all day, and the USB-C charging system includes advanced protection against overheating and overcharging, ensuring long-lasting reliability.",
    "inTheBox": [
      "JBL Flip 6",
      "Type-C Cable",
      "Quick Start Guide",
      "Safety Sheet"
    ],
    "extraImages": ["images/jbl-1.jpg", "images/jbl-2.jpg", "images/jbl-3.jpg"],
    "category": "speaker",
    "isNew": true
  },
  {
    "id": "4",
    "image": "images/bose-quietcomfort45.jpg",
    "name": "Bose QuietComfort 45",
    "description": "Iconic noise-cancelling headphones redesigned for comfort and clarity. Enjoy lifelike sound and up to 24 hours of battery life.",
    "price": 1450,
    "features": "The Bose QuietComfort 45 headphones deliver the perfect balance of silence, comfort, and high-fidelity sound. Using world-class Acoustic Noise Cancelling technology, they effortlessly block out distractions so you can focus on what matters. Their TriPort acoustic architecture produces deep, clear audio, while the Aware Mode allows external sounds to filter through naturally when needed. Crafted with premium materials, the lightweight frame and plush ear cushions ensure hours of comfortable listening. With up to 24 hours of battery life, quick charge support, and multi-device Bluetooth pairing, these headphones are built for both travel and daily use.",
    "inTheBox": ["Headphones", "Carry Case", "USB-C Cable", "Audio Cable"],
    "extraImages": [
      "images/bose-1.jpg",
      "images/bose-2.jpg",
      "images/bose-3.jpg"
    ],
    "category": "headphone",
    "isNew": false
  },
  {
    "id": "5",
    "image": "images/anker-soundcore-p3.jpg",
    "name": "Anker Soundcore Life P3",
    "description": "Compact earbuds with hybrid noise cancelling, 11mm drivers, and custom EQ. Perfect for music, work, and calls on the go.",
    "price": 450,
    "features": "Designed for modern lifestyles, the Soundcore Life P3 earbuds feature multi-mode active noise cancellation that adapts to your surroundings, whether you’re on public transport, in an office, or outdoors. With powerful 11mm dynamic drivers and Soundcore’s signature BassUp technology, your music sounds rich and detailed at any volume. AI-enhanced call noise reduction ensures your voice remains crisp during conversations, even in noisy environments. The Soundcore app lets you customize EQ settings, control ANC levels, and even activate a gaming mode for low-latency sound. The compact charging case supports wireless charging and extends total playtime up to 35 hours.",
    "inTheBox": [
      "Earbuds",
      "Charging Case",
      "USB-C Cable",
      "Ear Tips (3 sizes)"
    ],
    "extraImages": ["images/p3-1.jpg", "images/p3-2.jpg", "images/p3-3.jpg"],
    "category": "earphone",
    "isNew": true
  },
  {
    "id": "6",
    "image": "images/marshall-acton-iii.jpg",
    "name": "Marshall Acton III",
    "description": "A compact Bluetooth speaker that delivers iconic Marshall sound with refined, punchy bass and a stylish vintage design.",
    "price": 1250,
    "features": "The Marshall Acton III embodies the brand’s rock-and-roll heritage with a modern twist. It features a new three-way driver system that produces clear, controlled highs and powerful lows for a balanced soundstage. Its Bluetooth 5.2 connectivity ensures a stable and high-quality connection, while the analog control knobs let you fine-tune your audio experience. Built using sustainable materials, the Acton III is crafted for both performance and responsibility. Whether used as a centerpiece at home or a stylish desktop speaker, it fills any room with Marshall’s signature sound and classic look.",
    "inTheBox": ["Acton III Speaker", "Power Cord", "User Manual"],
    "extraImages": [
      "images/acton-1.jpg",
      "images/acton-2.jpg",
      "images/acton-3.jpg"
    ],
    "category": "speaker",
    "isNew": false
  },
  {
    "id": "7",
    "image": "images/samsung-galaxy-buds2-pro.jpg",
    "name": "Samsung Galaxy Buds2 Pro",
    "description": "Experience studio-quality sound and intelligent ANC with Samsung Galaxy Buds2 Pro. Designed for comfort and seamless Galaxy integration.",
    "price": 990,
    "features": "Samsung Galaxy Buds2 Pro bring studio-quality sound to your ears with 24-bit Hi-Fi audio, enhanced 360 Audio, and Intelligent Active Noise Cancellation. The ergonomic design fits naturally for extended listening comfort, while the lightweight build minimizes fatigue. Each earbud is equipped with advanced wind-noise reduction microphones for crystal-clear calls. The Buds2 Pro connect effortlessly with Galaxy devices for quick pairing, and SmartThings integration makes it easy to locate them if misplaced. With IPX7 water resistance and up to 29 hours of total playtime with the charging case, they’re built for both workouts and relaxation.",
    "inTheBox": [
      "Earbuds",
      "Charging Case",
      "USB-C Cable",
      "Ear Tips (3 sizes)"
    ],
    "extraImages": [
      "images/buds2-1.jpg",
      "images/buds2-2.jpg",
      "images/buds2-3.jpg"
    ],
    "category": "earphone",
    "isNew": true
  },
  {
    "id": "8",
    "image": "images/sony-xb33.jpg",
    "name": "Sony SRS-XB33",
    "description": "Extra Bass portable speaker with flashy lighting and rugged build. Perfect for parties and outdoor adventures.",
    "price": 720,
    "features": "The Sony SRS-XB33 packs power and durability into a compact frame. Built for outdoor fun, it delivers deep, punchy sound with Sony’s Extra Bass technology, while dual passive radiators enhance low-end frequencies. The speaker is IP67 rated for full water, dust, and shock resistance, and features a customizable light show that syncs to your music. Its Bluetooth 5.0 connection supports multiple devices and Party Connect mode for syncing up to 100 speakers simultaneously. With up to 24 hours of battery life and hands-free calling support, the SRS-XB33 ensures your music never stops, no matter where you go.",
    "inTheBox": ["Speaker", "USB-C Cable", "User Manual"],
    "extraImages": [
      "images/xb33-1.jpg",
      "images/xb33-2.jpg",
      "images/xb33-3.jpg"
    ],
    "category": "speaker",
    "isNew": false
  },
  {
    "id": "9",
    "image": "images/beats-solo3.jpg",
    "name": "Beats Solo3 Wireless",
    "description": "Iconic design and award-winning sound. With up to 40 hours of battery life and Apple’s W1 chip for seamless pairing.",
    "price": 1100,
    "features": "Beats Solo3 Wireless headphones are designed for life on the move, offering up to 40 hours of playtime on a single charge. Powered by the Apple W1 chip, they pair effortlessly with all Apple devices while maintaining Bluetooth compatibility for Android users. The cushioned ear cups are adjustable for everyday comfort, and Fast Fuel technology gives you 3 hours of playback from just a 5-minute charge. Solo3 delivers finely tuned acoustics for balanced clarity and powerful bass, all wrapped in a sleek, foldable design that’s as stylish as it is durable.",
    "inTheBox": [
      "Headphones",
      "Carrying Case",
      "Micro-USB Cable",
      "Quick Start Guide"
    ],
    "extraImages": [
      "images/solo3-1.jpg",
      "images/solo3-2.jpg",
      "images/solo3-3.jpg"
    ],
    "category": "headphone",
    "isNew": false
  },
  {
    "id": "10",
    "image": "images/nothing-ear2.jpg",
    "name": "Nothing Ear (2)",
    "description": "Hi-Res certified earbuds with transparent design, personalized sound, and adaptive noise cancellation.",
    "price": 880,
    "features": "Nothing Ear (2) merges striking transparent aesthetics with powerful audio performance. Each earbud houses a precision-engineered dynamic driver that delivers Hi-Res Audio certified sound with LHDC 5.0 codec support. The personalized sound profile adapts to your hearing, while adaptive noise cancellation automatically adjusts based on your surroundings. Dual connection allows seamless switching between two devices, and the lightweight case supports both wireless and wired charging. With IP54 water resistance, clear call quality via dual mics, and up to 36 hours of total battery life, these earbuds combine innovation and individuality.",
    "inTheBox": [
      "Earbuds",
      "Charging Case",
      "USB-C Cable",
      "Ear Tips (3 sizes)"
    ],
    "extraImages": [
      "images/ear2-1.jpg",
      "images/ear2-2.jpg",
      "images/ear2-3.jpg"
    ],
    "category": "earphone",
    "isNew": true
  }
]
